app/controllers/line_items_controller.rb

  def create
    #@line_item = LineItem.new(params[:line_item])
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.line_items.build(:product_id => product.id)


    respond_to do |format|
      if @line_item.save
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Wed, 15 Aug 2012 15:32:32 UTC +00:00], ["updated_at", Wed, 15 Aug 2012 15:32:32 UTC +00:00]]