app/controllers/store_controller.rb

SELECT "products".* FROM "products" ORDER BY title
SELECT "line_items".* FROM "line_items"
---
  def index
    @results=Product.order(:title)
    @cotilleo=LineItem.all